Tekla Open API Reference for Tekla Structures 2025
Events.LayoutTableInserted Event
 The event is raised when table is inserted
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event LayoutTableInsertedDelegate LayoutTableInserted
Public Event LayoutTableInserted As LayoutTableInsertedDelegate
Value
Type: LayoutTableInsertedDelegate
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace